LonelyWolf/stm32/stm32l151rdt6-dev/main.c
#include <stm32l1xx_rcc.h>
#include <stm32l1xx_gpio.h>
#include <stm32l1xx_syscfg.h>
#include <misc.h>

// Debug
#include <stdio.h>

// Libraries
#include "i2c.h"
#include "RTC.h"
#include "bmp180.h"
#include "bmc050.h"
#include "tsl2581.h"
#include "beeper.h"
#include "delay.h"
#include "wolk.h"
#include "sdcard-sdio.h"
#include "log.h"

// USB stuff
#include "usb_lib.h"
#include "VCP.h"

// DOSFS
#include "dosfs.h"




// GPS enable (PC1)
#define PWR_GPS_ENABLE_PORT       GPIOC
#define PWR_GPS_ENABLE_PIN        GPIO_Pin_1
#define PWR_GPS_ENABLE_PERIPH     RCC_AHBPeriph_GPIOC
#define PWR_GPS_ENABLE_H()        PWR_GPS_ENABLE_PORT->BSRRL = PWR_GPS_ENABLE_PIN
#define PWR_GPS_ENABLE_L()        PWR_GPS_ENABLE_PORT->BSRRH = PWR_GPS_ENABLE_PIN

// Vbat measure enable (PC3)
#define PWR_VBAT_ENABLE_PORT      GPIOC
#define PWR_VBAT_ENABLE_PIN       GPIO_Pin_3
#define PWR_VBAT_ENABLE_PERIPH    RCC_AHBPeriph_GPIOC
#define PWR_VBAT_ENABLE_H()       PWR_VBAT_ENABLE_PORT->BSRRL = PWR_VBAT_ENABLE_PIN
#define PWR_VBAT_ENABLE_L()       PWR_VBAT_ENABLE_PORT->BSRRH = PWR_VBAT_ENABLE_PIN

// LCD boost enable (PA4)
#define PWR_LCD_ENABLE_PORT       GPIOA
#define PWR_LCD_ENABLE_PIN        GPIO_Pin_4
#define PWR_LCD_ENABLE_PERIPH     RCC_AHBPeriph_GPIOA
#define PWR_LCD_ENABLE_H()        PWR_LCD_ENABLE_PORT->BSRRL = PWR_LCD_ENABLE_PIN
#define PWR_LCD_ENABLE_L()        PWR_LCD_ENABLE_PORT->BSRRH = PWR_LCD_ENABLE_PIN

// SD card enable (PA9)
#define PWR_SD_ENABLE_PORT        GPIOA
#define PWR_SD_ENABLE_PIN         GPIO_Pin_9
#define PWR_SD_ENABLE_PERIPH      RCC_AHBPeriph_GPIOA
#define PWR_SD_ENABLE_H()         PWR_SD_ENABLE_PORT->BSRRL = PWR_SD_ENABLE_PIN
#define PWR_SD_ENABLE_L()         PWR_SD_ENABLE_PORT->BSRRH = PWR_SD_ENABLE_PIN

// USB sense pin (PA10)
#define USB_SENS_PORT             GPIOA
#define USB_SENS_PIN              GPIO_IDR_IDR_10
#define USB_SENS_PERIPH           RCC_AHBPeriph_GPIOA
#define USB_SENS_EXTI             (1 << 10)

// Charger STAT pin (PC2)
#define CHRG_STAT_PORT            GPIOC
#define CHRG_STAT_PIN             GPIO_IDR_IDR_2
#define CHRG_STAT_PERIPH          RCC_AHBPeriph_GPIOC

// SD detect pin (PB3)
#define SD_DETECT_PORT            GPIOB
#define SD_DETECT_PIN             GPIO_IDR_IDR_3
#define SD_DETECT_PERIPH          RCC_AHBPeriph_GPIOB
#define SD_DETECT_EXTI            (1 << 3)



GPIO_InitTypeDef PORT;
volatile uint32_t _USB_int_cntr = 0;
volatile uint32_t _USB_connected = 0;
volatile uint32_t _SD_int_cntr = 0;
volatile uint32_t _SD_connected = 0;
volatile uint32_t _SD_last_state = 0;
uint32_t i,j,k;
uint8_t sector[2048];

uint16_t d0,d1;
BMP180_RESULT BR;
int16_t RT;
int32_t RP;
int16_t X,Y,Z,ACCT;

uint16_t ADC1_raws[16],Vrefint_raws[16];
uint32_t ADC1_raw,Vrefint_raw;
uint32_t Vbat,Vrefint,Vcpu;


NVIC_InitTypeDef NVICInit;




void RTC_WKUP_IRQHandler(void) {
	if (RTC->ISR & RTC_ISR_WUTF) {
		// RTC Wake-up interrupt

		// Disable sleep-on-exit (return to main loop from IRQ)
		SCB->SCR &= ~SCB_SCR_SLEEPONEXIT_Msk;

		PWR->CR  |= PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers enabled
		RTC->ISR &= ~RTC_ISR_WUTF; // Clear the RTC wake-up timer flag
		PWR->CR  &= ~PWR_CR_DBP; // Access to RTC, RTC Backup and RCC CSR registers disabled

		EXTI->PR = RTC_EXTI_LINE;
	}
}

// EXTI3 line IRQ handler
void EXTI3_IRQHandler(void) {
	if (EXTI->PR & SD_DETECT_EXTI) {
		_SD_int_cntr++;
		_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;
		if (_SD_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}
		EXTI->PR = SD_DETECT_EXTI; // Clear IT bit for EXTI_Line
	}
}

// EXTI[10..15] lines IRQ handler
void EXTI15_10_IRQHandler(void) {
	if (EXTI->PR & USB_SENS_EXTI) {
		_USB_int_cntr++;
		_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;
		if (_USB_connected) {
			BEEPER_PlayTones(tones_USB_con);
		} else {
			BEEPER_PlayTones(tones_USB_dis);
		}
		EXTI->PR = USB_SENS_EXTI; // Clear IT bit for EXTI_Line
	}
}

// SDIO IRQ handler
void SDIO_IRQHandler(void) {
	printf("\r\n###> IRQ SDIO [%X] CNT=%u\r\n",SDIO->STA,SDIO->FIFOCNT);

	// Clear SDIO interrupt bit
//	SDIO->ICR = 0x00FFFFFF;
	SDIO->ICR = SDIO_ICR_TXUNDERRC;
}

// DMA2 channel4 IRQ handler (SDIO DMA)
void DMA2_Channel4_IRQHandler(void) {
	uint32_t cntr;

	cntr = SDIO_DMA_CH->CNDTR;
	printf("\r\n###> IRQ DMA2 [%X] [%u]\r\n",DMA2->ISR,cntr);

	// Clear DMA interrupt bits
	DMA2->IFCR = DMA_IFCR_CGIF4 | DMA_IFCR_CHTIF4 | DMA_IFCR_CTCIF4 | DMA_IFCR_CTEIF4;
}

uint32_t InterquartileMean(uint16_t *array, uint32_t numOfSamples) {
	uint32_t sum=0;
	uint32_t index, maxindex;

	// discard the lowest and the highest data samples
	maxindex = 3 * numOfSamples / 4;
	for (index = (numOfSamples / 4); index < maxindex; index++) {
		sum += array[index];
	}
	// return the mean value of the remaining samples value

	return (sum / (numOfSamples / 2));
}




int main(void) {
	// Enable debugging when the MCU is in low power modes
//	DBGMCU->CR |= DBGMCU_CR_DBG_SLEEP | DBGMCU_CR_DBG_STOP | DBGMCU_CR_DBG_STANDBY;




	// Enable the system configuration controller
	RCC->APB2ENR |= RCC_APB2ENR_SYSCFGEN;




	// Enable and configure RTC
//	RTC_Config();
//	RTC_SetWakeUp(10);




	Delay_Init(NULL);
	BEEPER_Init();




	// Enable power control lines GPIO
	RCC_AHBPeriphClockCmd(
			PWR_GPS_ENABLE_PERIPH |
			PWR_SD_ENABLE_PERIPH |
			PWR_VBAT_ENABLE_PERIPH |
			PWR_LCD_ENABLE_PERIPH,
			ENABLE); // Enable power control peripherals

	// Configure power control lines as push-pull output without pull-up
	PORT.GPIO_Mode  = GPIO_Mode_OUT;
	PORT.GPIO_Speed = GPIO_Speed_400KHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd  = GPIO_PuPd_NOPULL;

	PORT.GPIO_Pin = PWR_GPS_ENABLE_PIN;
	GPIO_Init(PWR_GPS_ENABLE_PORT,&PORT);
	PWR_GPS_ENABLE_L(); // Turn off

	PORT.GPIO_Pin = PWR_SD_ENABLE_PIN;
	GPIO_Init(PWR_SD_ENABLE_PORT,&PORT);
	PWR_SD_ENABLE_L(); // Turn off

	PORT.GPIO_Pin = PWR_VBAT_ENABLE_PIN;
	GPIO_Init(PWR_VBAT_ENABLE_PORT,&PORT);
	PWR_VBAT_ENABLE_L(); // Turn off

	PORT.GPIO_Pin = PWR_LCD_ENABLE_PIN;
	GPIO_Init(PWR_LCD_ENABLE_PORT,&PORT);
	PWR_LCD_ENABLE_L(); // Turn off




	// Configure MCO out
	PORT.GPIO_Pin = GPIO_Pin_8;
	PORT.GPIO_Mode = GPIO_Mode_AF;
	PORT.GPIO_Speed = GPIO_Speed_40MHz;
	PORT.GPIO_OType = GPIO_OType_PP;
	PORT.GPIO_PuPd = GPIO_PuPd_NOPULL;
	GPIO_Init(GPIOA,&PORT);
	RCC_MCOConfig(RCC_MCOSource_PLLCLK,RCC_MCODiv_16);




	// Configure USB sense pin
	RCC->AHBENR |= USB_SENS_PERIPH; // Enable USB sense pin port peripheral

	// Configure GPIO pin as input with pull-up
	USB_SENS_PORT->MODER &= ~GPIO_MODER_MODER10; // Input mode (reset state)
	USB_SENS_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR10; // Floating (clear bits)
//	USB_SENS_PORT->PUPDR |=  GPIO_PUPDR_PUPDR10_0; // Pull-up
	USB_SENS_PORT->PUPDR |=  GPIO_PUPDR_PUPDR10_1; // Pull-down

	// Configure the EXTI line (USB sense pin)
	EXTI->PR    =  USB_SENS_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  USB_SENS_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~USB_SENS_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  USB_SENS_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  USB_SENS_EXTI; // Trigger falling edge enabled

	// PA10 as source input for EXTI10
	// In fact this is not necessary because it is the default condition after reset
	SYSCFG->EXTICR[2] &= ~SYSCFG_EXTICR3_EXTI10; // Clear bits (Set PA10 pin as input source)
	SYSCFG->EXTICR[2] |=  SYSCFG_EXTICR3_EXTI10_PA; // Set PA10 pin as input source

