LonelyWolf/stm32/stm32l151rdt6-dev/main.c
/*
	// 2 bit for pre-emption priority, 2 bits for subpriority
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	// Enable the USB sense pin interrupt
	NVICInit.NVIC_IRQChannel = EXTI15_10_IRQn;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
	NVICInit.NVIC_IRQChannelSubPriority = 0;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVICInit);
*/

	NVIC_EnableIRQ(EXTI15_10_IRQn);

	_USB_connected = (USB_SENS_PORT->IDR & USB_SENS_PIN) ? 1 : 0;




	if (_USB_connected) {
		// Configure the USB peripheral
		USB_HWConfig();
		// Initialize the USB device
		USB_Init();
	}




	// Configure charger STAT pin
	RCC->AHBENR |= CHRG_STAT_PERIPH; // Enable charger STAT pin port peripheral

	// Configure GPIO pin as input with pull-up
	CHRG_STAT_PORT->MODER &= ~GPIO_MODER_MODER2; // Input mode (reset state)
	CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
	CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up




	// Configure SD detect pin
	RCC->AHBENR |= SD_DETECT_PERIPH; // Enable SD detect pin port peripheral

	// ------------ WARNING -------------
	// PB3 mapped as JTDO after reset, it must be switched to GPIO function here!
	// ------------ WARNING -------------

	/////////////////////////////////////////////////////////////////////////////////////////////
	// To use the serial wire DP to release some GPIOs, the user software must change the GPIO //
	// (PA15, PB3 and PB4) configuration mode in the GPIO_MODER register. This releases        //
	// PA15, PB3 and PB4 which now become available as GPIOs.                                  //
	/////////////////////////////////////////////////////////////////////////////////////////////

	// Configure GPIO pin as input with pull-up
	SD_DETECT_PORT->MODER &= ~GPIO_MODER_MODER3; // Input mode (reset state)
	SD_DETECT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR3; // Floating (clear bits)

	// Configure the EXTI line (SD detect pin)
	EXTI->PR    =  SD_DETECT_EXTI; // Clear IT pending bit for EXTI
	EXTI->IMR  |=  SD_DETECT_EXTI; // Enable interrupt request from EXTI
	EXTI->EMR  &= ~SD_DETECT_EXTI; // Disable event on EXTI
	EXTI->RTSR |=  SD_DETECT_EXTI; // Trigger rising edge enabled
	EXTI->FTSR |=  SD_DETECT_EXTI; // Trigger falling edge enabled

	// PB3 as source input for EXTI3
	SYSCFG->EXTICR[0] &= ~SYSCFG_EXTICR1_EXTI3; // Clear bits (Set PA3 pin as input source)
	SYSCFG->EXTICR[0] |=  SYSCFG_EXTICR1_EXTI3_PB; // Set PB3 pin as input source

/*
	// 2 bit for pre-emption priority, 2 bits for subpriority
	NVIC_PriorityGroupConfig(NVIC_PriorityGroup_2);

	// Enable the USB sense pin interrupt
	NVICInit.NVIC_IRQChannel = EXTI3_IRQn;
	NVICInit.NVIC_IRQChannelPreemptionPriority = 2;
	NVICInit.NVIC_IRQChannelSubPriority = 0;
	NVICInit.NVIC_IRQChannelCmd = ENABLE;
	NVIC_Init(&NVICInit);
*/

	NVIC_EnableIRQ(EXTI3_IRQn);

	_SD_connected = (SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? 0 : 1;




	if (CoreDebug->DHCSR & (1 << CoreDebug_DHCSR_C_DEBUGEN_Pos)) {
		// Application executed under debugger control
		BEEPER_Enable(333,3);
		Delay_ms(500);
	} else {
		if (PWR->CSR & PWR_CSR_SBF) {
			// Device has been in STANDBY mode
			PWR->CR |= (PWR_CR_CWUF | PWR_CR_CSBF);
			BEEPER_Enable(4000,3);
			Delay_ms(5000);
		} else {
			// Device has not been in STANDBY mode
			BEEPER_Enable(1000,3);
			Delay_ms(1500);
		}
	}




	// Check Vbat measurement

	// Enable the PORTA peripheral
	RCC->AHBENR |= RCC_AHBPeriph_GPIOA;

	// Configure PA1 as analog (for ADC_IN1)
	GPIOA->MODER |=  GPIO_MODER_MODER1; // Analog mode

	// Enable Vbat divider
	PWR_VBAT_ENABLE_H(); // Turn on

	// Initialize the HSI clock
	RCC->CR |= RCC_CR_HSION; // Enable HSI
	while (!(RCC->CR & RCC_CR_HSIRDY)); // Wait until HSI stable

	// Initialize the ADC
	RCC->APB2ENR |= RCC_APB2ENR_ADC1EN; // Enable the ADC1 peripheral clock
	ADC->CCR = ADC_CCR_TSVREFE; // Enable Vrefint and temperature sensor, ADC prescaler = HSI/1
	while(!(PWR->CSR & PWR_CSR_VREFINTRDYF)); // Wait until Vrefint stable

	// Configure the ADC
	ADC1->CR1 &= ~ADC_CR1_RES; // 12-bit resolution (Tconv = 12 ADCCLK cycles)
	ADC1->CR1 |= ADC_CR1_SCAN | ADC_CR1_PDI; // Scan mode, power down during the idle phase
	ADC1->CR2 &= ~ADC_CR2_ALIGN; // Right alignment

	// ADC channels sample rate
	ADC1->SMPR3 |= ADC_SMPR3_SMP1; // Channel 1: 384 cycles
	ADC1->SMPR2 |= ADC_SMPR2_SMP17; // Channel 17: 384 cycles

	// Injected sequence (2 conversions: first ADC_IN1, then ADC_IN17)
	ADC1->JSQR = ADC_JSQR_JL_0 | ADC_JSQR_JSQ3_0 | ADC_JSQR_JSQ4_0 | ADC_JSQR_JSQ4_4;

	// Enable the ADC
	ADC1->CR2 |= ADC_CR2_ADON;
	while (!(ADC1->SR & ADC_SR_ADONS)); // Wait until ADC is on




	// Initialize the I2C peripheral
	if (I2Cx_Init(I2C1,400000) != I2C_SUCCESS) {
		printf("I2C initialization failed\r\n");
		SleepStandby();
	}



	// Check the ALS
	TSL2581_Init();
	TSL2581_SetGain(TSL2581_GAIN8);
	d0 = TSL2581_GetData0();
	d1 = TSL2581_GetData1();
//	TSL2581_PowerOff();



	// Check the BMP180
    BMP180_Reset(); // Send reset command to BMP180
    Delay_ms(15); // Wait for BMP180 startup time (10ms by datasheet)
	if (BMP180_Check() == BMP180_SUCCESS) {
		BMP180_ReadCalibration();
		BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
	}




	// Check the BMC050
	BMC050_ACC_SoftReset();
	Delay_ms(5); // must wait for start-up time of accelerometer (2ms)
	BMC050_Init();

	// Enable I2C watchdog timer with 50ms
	BMC050_ACC_InterfaceConfig(ACC_IF_WDT_50ms);

	BMC050_ACC_SetBandwidth(ACC_BW8); // Accelerometer readings filtering (lower or higher better?)
	BMC050_ACC_SetIRQMode(ACC_IM_NOLATCH); // No IRQ latching
	BMC050_ACC_ConfigSlopeIRQ(0,8); // Motion detection sensitivity
	BMC050_ACC_IntPinMap(ACC_IM1_SLOPE); // Map slope interrupt to INT1 pin
	BMC050_ACC_SetIRQ(ACC_IE_SLOPEX | ACC_IE_SLOPEY | ACC_IE_SLOPEZ); // Detect motion by all axes
	BMC050_ACC_LowPower(ACC_SLEEP_1000); // Low power with sleep duration 1s
//	BMC050_ACC_LowPower(ACC_SLEEP_1); // Low power with sleep duration 1ms

//	BMC050_ACC_Suspend();




	PWR_SD_ENABLE_H(); // Turn SD on

	// Enable the DMA2 peripheral clock
	RCC->AHBENR |= RCC_AHBENR_DMA2EN;

	// Enable the DMA2 channel4 interrupt
//	NVIC_EnableIRQ(DMA2_Channel4_IRQn);

	// Enable the SDIO interrupt
//	NVIC_EnableIRQ(SDIO_IRQn);

//	if (!(SD_DETECT_PORT->IDR & SD_DETECT_PIN)) {
	if (_SD_connected) {
		SD_SDIO_GPIO_Init();
		j = SD_Init();
		printf("SD_Init: %X\r\n",j);
	} else j = SDR_NoResponse;

