LonelyWolf/stm32/stm32l151rdt6-dev/main.c
/*
		// Calculate rough average of ADC readings
		Vrefint_raw = Vrefint_raws[0];
		ADC1_raw = ADC1_raws[0];
		for (i = 1; i < 16; i++) {
			Vrefint_raw += Vrefint_raws[i];
			ADC1_raw += ADC1_raws[i];
			Vrefint_raw >>= 1;
			ADC1_raw >>= 1;
		}
*/

		Vbat = (uint16_t)(((*VREFINT_CAL * ADC1_raw * 3.0)/(Vrefint_raw * 4095.0)) * 1000);
		Vrefint = (uint16_t)(((Vrefint_raw * 3.0) / 4095.0) * 1000);
		Vcpu = (uint16_t)(((*VREFINT_CAL * 3.0) / Vrefint_raw) * 1000);

		printf("VOL: Bat=[%u.%03uV -> %u.%03uV] Ref=%u.%03uV CPU=%u.%03uV\r\n",
				(unsigned int)Vbat / 1000, (unsigned int)Vbat % 1000,
				((unsigned int)Vbat / 1000) * 2, ((unsigned int)Vbat % 1000) * 2,
				(unsigned int)Vrefint / 1000, (unsigned int)Vrefint % 1000,
				(unsigned int)Vcpu / 1000, (unsigned int)Vcpu % 1000);

		// Get ALS readings
		d0 = TSL2581_GetData0();
		d1 = TSL2581_GetData1();
		printf("ALS: D0=%u D1=%u\r\n", (unsigned int)d0, (unsigned int)d1);

		// Get accelerometer readings
		BMC050_ACC_GetXYZ(&X,&Y,&Z);
		ACCT = BMC050_ReadTemp();
		printf("ACC: X=%d Y=%d Z=%d T=%d.%dC\r\n", X, Y, Z, ACCT / 10, ACCT % 10);

		// Get barometer readings
		BR = BMP180_GetReadings(&RT,&RP,BMP180_ADVRES);
		if (BR == BMP180_SUCCESS) {
			RP = BMP180_hPa_to_mmHg(RP);
			printf("BAR: T=%d.%dC P=%u.%ummHg\r\n", RT / 10, RT % 10, (unsigned int)RP / 10, (unsigned int)RP % 10);
		} else {
			printf("BAR: failed\r\n");
		}

		// USB sense pin state
		printf("USB: %s (%d)\r\n",_USB_connected ? "connected" : "disconnected",(unsigned int)_USB_int_cntr);

		// Get charger STAT pin state
		i = 0;
		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		Delay_ms(100);
		printf("CHG: NONE=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_1; // Pull-down
		Delay_ms(100);
		printf("PD=%d ",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));
		if (CHRG_STAT_PORT->IDR & CHRG_STAT_PIN) i++;

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)
		CHRG_STAT_PORT->PUPDR |=  GPIO_PUPDR_PUPDR2_0; // Pull-up
		Delay_ms(100);
		printf("PU=%d\r\n",(unsigned int)(CHRG_STAT_PORT->IDR & CHRG_STAT_PIN));

		CHRG_STAT_PORT->PUPDR &= ~GPIO_PUPDR_PUPDR2; // Floating (clear bits)

		// Get state of SD detect pin
//		printf("SDP: %s\r\n",(SD_DETECT_PORT->IDR & SD_DETECT_PIN) ? "no card" : "present");

		// SD card state
		printf("SDC: %s (%d)\r\n",_SD_connected ? "present" : "no card",(unsigned int)_SD_int_cntr);

		if (_SD_last_state != _SD_connected) {
			if (_SD_connected) {
				// The SD card was inserted, need to initialize it
				j = SD_Init();
				printf("SD_Init: %X\r\n",j);
			}
		}
		_SD_last_state = _SD_connected;

		// Read some blocks from the SD card
//		if (!(SD_DETECT_PORT->IDR & SD_DETECT_PIN)) {
		if (_SD_connected) {
/*
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock(0,(uint32_t *)sector,2048);
			printf("SD_ReadBlock = %02X, ",j);
			if (j != SDR_Success) BEEPER_Enable(1111,1);
			j = SD_GetCardState(&sector[0]);
			printf("SD_GetCardState = %02X [%X]\r\n",j,sector[0]);
			VCP_SendBufPrintable(sector,128,'.');
			VCP_SendStr("\r\n");
*/
			for (i = 0; i < 2048; ) sector[i++] = '#';
			j = SD_ReadBlock_DMA(0,(uint32_t *)sector,2048);
			printf("SD_ReadBlock_DMA = %02X, ",j);
			if (j == SDR_Success) {
				j = SD_CheckRead(2048);
				printf("SD_CheckRead = %02X, ",j);
			}
			if (j != SDR_Success) BEEPER_Enable(4444,1);
			j = SD_GetCardState(&sector[0]);
			printf("SD_GetCardState = %02X [%X]\r\n",j,sector[0]);
			VCP_SendBufPrintable(sector,128,'.');
			VCP_SendStr("\r\n");
		}

		printf("------------------\r\n");

		Delay_ms(2000);
	}




	PWR->CSR |= PWR_CSR_EWUP1; // Enable WKUP pin 1 (PA0)
	PWR->CSR |= PWR_CSR_EWUP2; // Enable WKUP pin 2 (PC13)
	SleepStandby();




	while(1);
}
